tests/login-and-test.yml
passCriteria:
  aggregate.scenarioDuration.p99:
    lessThan: 3000
  aggregate.errors:
    isEmptyObject: true
  aggregate.codes.500:
    isUndefined: true

config:
  processor: "../library/helper-functions.js"
  target: "https://aslive-app.parr-global.com"
  http:
    timeout: 10
  phases:
    - name: "Warm up"
      arrivalRate: 1
      rampTo: 3
      duration: 3

    - name: "Constant medium load"
      arrivalRate: 2
      duration: 10

    - name: "Constant medium load"
      arrivalRate: 4
      duration: 10

scenarios:
  - name: "Log in, then view an intel"
    flow:
      - post:
          url: "/login"
          form:
            username: "parr_fe_all"
            password: "XXXXX"
          afterResponse: "logHttpOnError"
          capture:
            header: "set-cookie"
            as: "AuthenticationCookie"

      - get:
          url: "/intelligence/view/498"
          headers:
            Cookie: "{{ AuthenticationCookie }}"
          afterResponse: "logHttpOnError"